<a href="https://colab.research.google.com/github/annanya-mathur/Numpy-Pandas-in-python/blob/main/Extracting%20tables%20from%20html%20file.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [5]:
# extracting html file   
a=pd.read_html('https://simple.wikipedia.org/wiki/Aaron_Paul#:~:text=Aaron%20Paul%20From%20Simple%20English%20Wikipedia%2C%20the%20free,on%20the%20AMC%20drama%20series%20Breaking%20Bad%20%282008%E2%80%932013%29.')
len(a)

5

In [6]:
# accessing first table
a[0]

              Aaron Paul                                       Aaron Paul.1
0  Paul in February 2014                              Paul in February 2014
1                   Born  Aaron Paul Sturtevant (age 41)Emmett, Idaho, U.S.
2            Nationality                                           American
3             Occupation                                              Actor
4           Years active                                       1998–present
5              Spouse(s)                         Lauren Parsekian (m. 2013)
6               Children                                                  1

In [8]:
a[3]

   Year                   Song    Artist               Role
0  2002            Thoughtless      Korn  Floyd Louis Cifer
1  2003  White Trash Beautiful  Everlast          Boyfriend